<?php

namespace Database\Seeders;

use Illuminate\Support\Facades\DB;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class Post extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('posts')->insert([
            'name' => 'Допомога',
            'description' => 'З першого дня війни російські війська варварські винищують цивільну інфраструктуру та мирне населення Харкова. Системних авіаударів та бомбардування зазнають і житлові будинки, і лікарні, і школи, і університети.
Наразі достеменно відомо про загибель від обстрілів нашого професора Олега Амосова, про зникнення та можливу загибель доцента Костянтина Мягкохліба, про наших поранених колег.
В Харкові під загрозою, подекуди в скрутному стані працівники, серед яких багато жінок та літніх людей, їх сімї. В гуртожитках все ще залишаються студенти, яких ми намагаємося підтримати, забезпечити та убезпечити!
    Нам потрібна допомога! Ми працюємо в надскладних умовах, але також маємо надію на підтримку вже зараз!
    Каразінський університет варварські руйнується! Ракетним ударом вщент зруйновано корпус на Мироносицький, прямим влучанням розбито Спорткомплекс «Каразінський», пошкоджені головний та північний корпуси, будівля інституту «Фізико-технічний факультет», гуртожитки, музей природи, стара будівля Центральної наукової бібліотеки на Університетській. Помешкання наших професорів та працівників подекуди знаходяться в зонах інтенсивних обстрілів, руйнуються та в умовах низьких температур стають непридатними для проживання! Організовуємо евакуацію та переміщення.
    Будівлі, за підтримки держави та меценатів, є надія, що відбудуємо. Але під загрозою культурна спадщина, яку відновити буде неможливо. Така, як рідкісні старовинні книги та рукописи університетської бібліотеки. Їх треба рятувати!
    Звертаємося до всіх небайдужих! Випускників, меценатів, партнерів, міжнародних донорів! Каразінський університет оголошує збір коштів для допомоги університетській спільноті:
⁃ гуманітарна допомога та евакуація студентів з гуртожитків;
⁃ евакуація працівників, які наразі цього потребують.
    За бажанням ви можете перевести кошти в підтримку університету на рахунки асоціації випускників:
гривневий рахунок Асоціації випускників Каразінського університету UA763510050000026002036365200
(ГО «АСОЦІАЦІЯ ВИПУСКНИКІВ ХНУ»,
ЕДРПОУ 26488507,
UA 763510050000026002036365200
в АТ «УкрСиббанк», ЕДРПОУ 09807750, МФО 351005)
Призначення платежу: «Допомога Каразінському університету»
Каразінці, партнери та всі небайдужі! Єднаймося, допомагаймо один одному та зберігаймо наш університет!
А як прийде час перемоги, ми обовязково все відбудуємо!
    Україна переможе!"',
        ]);
    }
}
